УТ/src/DataProcessors/CRM_МастерРегистрацииОбращения/CRM_МастерРегистрацииОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МастерРегистрацииОбращения</name>
</mdclass:DataProcessor>

УТ/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьСвязанныеДиалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЧекЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаВыполненияЧекЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_МастерРегистрацииОбращения/Forms/ФормаВыбораПроцесса/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Карты = CRM_БизнесПроцессыСервер.ВернутьСпискиДоступныхКарт(Истина);
	
	ЗаполнитьДоступныеСценарииИнтересов(СписокДоступныхПроцессов, Параметры.Ответственный, Параметры.ТипУслуги);
	
	Для Каждого ЭлементСписка Из Карты Цикл
		СписокДоступныхПроцессов.Добавить(ЭлементСписка.Значение, Строка(ЭлементСписка.Значение), ,
			 БиблиотекаКартинок.БизнесПроцессОбъект);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СписокДоступныхПроцессов.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, СписокДоступныхПроцессов[0].Значение);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.СписокДоступныхПроцессов.ТекущаяСтрока = 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДоступныхПроцессов

&НаКлиенте
Процедура СписокДоступныхПроцессовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(СписокДоступныхПроцессов[ВыбраннаяСтрока].Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СписокДоступныхПроцессов[Элементы.СписокДоступныхПроцессов.ТекущаяСтрока].Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоступныеСценарииИнтересов(СписокСценариев, Ответственный, ТипУслуги)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпПустыеПодраздеоения
	|ИЗ
	|	(ВЫБРАТЬ
	|		CRM_СостоянияИнтересов.Ссылка КАК Ссылка,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_СостоянияИнтересовПодразделения.Ссылка) КАК Ссылка1
	|	ИЗ
	|		Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.Подразделения КАК CRM_СостоянияИнтересовПодразделения
	|			ПО CRM_СостоянияИнтересов.Ссылка = CRM_СостоянияИнтересовПодразделения.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		CRM_СостоянияИнтересов.Ссылка) КАК ВложенныйЗапрос
	|ГДЕ
	|	ЕСТЬNULL(ВложенныйЗапрос.Ссылка1, 0) = 0
	|	И ВложенныйЗапрос.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_СостоянияИнтересовПодразделения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпДоступныеПоПодразделению
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов.Подразделения КАК CRM_СостоянияИнтересовПодразделения
	|ГДЕ
	|	CRM_СостоянияИнтересовПодразделения.Подразделение В ИЕРАРХИИ(&Подразделение)
	|	И CRM_СостоянияИнтересовПодразделения.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	тмпПустыеПодраздеоения.Ссылка
	|ИЗ
	|	тмпПустыеПодраздеоения КАК тмпПустыеПодраздеоения
	|
	|СГРУППИРОВАТЬ ПО
	|	тмпПустыеПодраздеоения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_СостоянияИнтересовТипыУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпДоступныеПоФильтрам
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов.ТипыУслуг КАК CRM_СостоянияИнтересовТипыУслуг
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ИспользоватьТипыУслуг 
	|			И НЕ CRM_СостоянияИнтересовТипыУслуг.ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.Пустаяссылка)
	|			ТОГДА CRM_СостоянияИнтересовТипыУслуг.ТипУслуги = &ТипУслуги
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ CRM_СостоянияИнтересовТипыУслуг.Ссылка.ПометкаУдаления
	|	И CRM_СостоянияИнтересовТипыУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				тмпДоступныеПоПодразделению.Ссылка КАК Ссылка
	|			ИЗ
	|				тмпДоступныеПоПодразделению КАК тмпДоступныеПоПодразделению)
	|	И CRM_СостоянияИнтересовТипыУслуг.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|	И НЕ CRM_СостоянияИнтересовТипыУслуг.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпБезТиповУслуг
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	|ГДЕ
	|	НЕ CRM_СостоянияИнтересов.Ссылка В
	|				(ВЫБРАТЬ
	|					CRM_СостоянияИнтересовТипыУслуг.Ссылка КАК Ссылка
	|				ИЗ
	|					Справочник.CRM_СостоянияИнтересов.ТипыУслуг КАК CRM_СостоянияИнтересовТипыУслуг
	|				ГДЕ
	|					CRM_СостоянияИнтересовТипыУслуг.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|				СГРУППИРОВАТЬ ПО
	|					CRM_СостоянияИнтересовТипыУслуг.Ссылка)
	|	И НЕ CRM_СостоянияИнтересов.Ссылка.ПометкаУдаления
	|	И CRM_СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				тмпДоступныеПоПодразделению.Ссылка КАК Ссылка
	|			ИЗ
	|				тмпДоступныеПоПодразделению КАК тмпДоступныеПоПодразделению)
	|	И CRM_СостоянияИнтересов.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тмпДоступныеПоФильтрам.Ссылка КАК Ссылка
	|ИЗ
	|	тмпДоступныеПоФильтрам КАК тмпДоступныеПоФильтрам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тмпБезТиповУслуг.Ссылка
	|ИЗ
	|	тмпБезТиповУслуг КАК тмпБезТиповУслуг";
	Запрос.УстановитьПараметр("ТипУслуги", ТипУслуги);
	Запрос.УстановитьПараметр("ИспользоватьТипыУслуг", ПолучитьФункциональнуюОпциюФормы("CRM_ИспользоватьТипыУслуг"));
	Запрос.УстановитьПараметр("Подразделение", Ответственный.Подразделение);

	СписокСценариев.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

#КонецОбласти
